Taxi/test_selfemployed_fns_proxy/static/test_fns_client/requests/get_newly_unbound.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:SendMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:GetNewlyUnboundTaxpayersRequest
            xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/SMZ/SmzPartnersIntegrationService/types/1.0">
          <ns1:From>2021-01-01T00:00:00</ns1:From>
          <ns1:Limit>10</ns1:Limit>
          <ns1:Offset>0</ns1:Offset>
        </ns1:GetNewlyUnboundTaxpayersRequest>
      </ns0:Message>
    </ns0:SendMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
