Taxi/test_selfemployed_fns_proxy/static/test_fns_client/requests/get_inn.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:SendMessageRequest
        xmlns:ns0="urn://x-artefacts-gnivc-ru/inplat/servin/OpenApiAsyncMessageConsumerService/types/1.0">
      <ns0:Message>
        <ns1:GetInnByPersonalInfoRequestV3
            xmlns:ns1="urn://x-artefacts-gnivc-ru/ais3/SMZ/SmzPartnersIntegrationService/types/1.0">
          <ns1:PersonalInfoList>
            <ns1:FirstName>FN</ns1:FirstName>
            <ns1:SecondName>LN</ns1:SecondName>
            <ns1:Patronymic>MN</ns1:Patronymic>
            <ns1:Birthday>2021-01-01</ns1:Birthday>
            <ns1:DocumentSpdul>21</ns1:DocumentSpdul>
            <ns1:DocumentSeries>PS</ns1:DocumentSeries>
            <ns1:DocumentNumber>PN</ns1:DocumentNumber>
          </ns1:PersonalInfoList>
        </ns1:GetInnByPersonalInfoRequestV3>
      </ns0:Message>
    </ns0:SendMessageRequest>
  </soap-env:Body>
</soap-env:Envelope>
